# 20210402.2 OSPF exercices packet tracer



show ip protocol , verifier ce qui a été configurer


##### ***config ospf***

    R2(config)#router ?
      bgp    Border Gateway Protocol (BGP)
      eigrp  Enhanced Interior Gateway Routing Protocol (EIGRP)
      ospf   Open Shortest Path First (OSPF)
      rip    Routing Information Protocol (RIP)
    R2(config)#router ospf ?
      <1-65535>  Process ID
    R2(config)#router ospf 1



    R2(config-router)#do sh ip protocol
      Routing Protocol is "ospf 1"
        Outgoing update filter list for all interfaces is not set 
        Incoming update filter list for all interfaces is not set 
        Router ID 172.16.0.9                                    
        Number of areas in this router is 0. 0 normal 0 stub 0 nssa
        Maximum path: 4
        Routing for Networks:                                  >>>> premier point de verification
        Routing Information Sources:                           >>>> liste les routeurs qui nous ont appris quelque chose 
          Gateway         Distance      Last Update 
        Distance: (default is 110)


##### ***Config routeur id***

    R2(config-router)#router-id 2.2.2.2

    R2(config-router)#do sh ip protocol
        Routing Protocol is "ospf 1"
          Outgoing update filter list for all interfaces is not set 
          Incoming update filter list for all interfaces is not set 
          Router ID 2.2.2.2
          Number of areas in this router is 0. 0 normal 0 stub 0 nssa
          Maximum path: 4
          Routing for Networks:
          Routing Information Sources:  
            Gateway         Distance      Last Update 
          Distance: (default is 110)

#### *** mettre une interface dans une aera ***

##### *** 1ere methode ***

    R2(config-router)#network ?
      A.B.C.D  Network number
    R2(config-router)#network 172.16.0.0 0.0.0.3 area 0           0.0.0.3 = wildcard mask
   

      verificiation


      Routing Protocol is "ospf 1"
      Outgoing update filter list for all interfaces is not set 
      Incoming update filter list for all interfaces is not set 
      Router ID 2.2.2.2
      Number of areas in this router is 1. 1 normal 0 stub 0 nssa
      Maximum path: 4
      Routing for Networks:
        172.16.0.0 0.0.0.3 area 0
      Routing Information Sources:  
        Gateway         Distance      Last Update 
        2.2.2.2              110      00:00:07
      Distance: (default is 110)

##### ***2eme methode ***

    R2(config-router)#network 172.16.0.9 0.0.0.0 area 0


##### *** verification interface***

##### ***R2#sh ip ospf interface ( brief )***

          Serial0/0/0 is up, line protocol is up
            Internet address is 172.16.0.2/30, Area 0
            Process ID 1, Router ID 2.2.2.2, Network Type POINT-TO-POINT, Cost: 64
            Transmit Delay is 1 sec, State POINT-TO-POINT,
            Timer intervals configured, Hello 10, Dead 40, Wait 40, Retransmit 5
              Hello due in 00:00:09
            Index 1/1, flood queue length 0
            Next 0x0(0)/0x0(0)
            Last flood scan length is 1, maximum is 1
            Last flood scan time is 0 msec, maximum is 0 msec
            Suppress hello for 0 neighbor(s)
          GigabitEthernet0/1 is up, line protocol is up
            Internet address is 172.16.0.9/30, Area 0
            Process ID 1, Router ID 2.2.2.2, Network Type BROADCAST, Cost: 1
            Transmit Delay is 1 sec, State DR, Priority 1
            Designated Router (ID) 2.2.2.2, Interface address 172.16.0.9
            No backup designated router on this network
            Timer intervals configured, Hello 10, Dead 40, Wait 40, Retransmit 5
              Hello due in 00:00:05
            Index 2/2, flood queue length 0
            Next 0x0(0)/0x0(0)
            Last flood scan length is 1, maximum is 1
            Last flood scan time is 0 msec, maximum is 0 msec
            Neighbor Count is 0, Adjacent neighbor count is 0
            Suppress hello for 0 neighbor(s)

##### ***sh ip ospf database***

                    OSPF Router with ID (2.2.2.2) (Process ID 1)

                        Router Link States (Area 0)

        Link ID         ADV Router      Age         Seq#       Checksum Link count
        2.2.2.2         2.2.2.2         389         0x80000002 0x00e393 2


##### ***R2#sh ip ospf neighbor***

          rien car pas encore de voisin


##### ***configuration ospf de r4***

      Router#conf t
      Enter configuration commands, one per line.  End with CNTL/Z.
      Router(config)#router ospf 10
      Router(config-router)#router-id 4.4.4.4
      Router(config-router)#network 172.16.0.0 0.0.255.255 area 0   


      sh ip protocol

      Routing Protocol is "ospf 10"
        Outgoing update filter list for all interfaces is not set 
        Incoming update filter list for all interfaces is not set 
        Router ID 4.4.4.4
        Number of areas in this router is 1. 1 normal 0 stub 0 nssa
        Maximum path: 4
        Routing for Networks:
          172.16.0.0 0.0.255.255 area 0
        Routing Information Sources:  
          Gateway         Distance      Last Update 
          2.2.2.2              110      00:01:32
          4.4.4.4              110      00:01:32
        Distance: (default is 110)


        Router#sh ip ospf nei


        Neighbor ID     Pri   State           Dead Time   Address         Interface
        2.2.2.2           1   FULL/DR         00:00:34    172.16.0.9      GigabitEthernet0/1





        Router#show ip ospf database
                      OSPF Router with ID (4.4.4.4) (Process ID 10)

                          Router Link States (Area 0)

          Link ID         ADV Router      Age         Seq#       Checksum Link count
          4.4.4.4         4.4.4.4         290         0x80000003 0x00a22d 2
          2.2.2.2         2.2.2.2         290         0x80000003 0x001b92 2

                          Net Link States (Area 0)
          Link ID         ADV Router      Age         Seq#       Checksum
          172.16.0.9      2.2.2.2         290         0x80000001 0x00d12b






          R4#sh ip route
          Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
                D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
                N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
                E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
                i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
                * - candidate default, U - per-user static route, o - ODR
                P - periodic downloaded static route

          Gateway of last resort is not set

              172.16.0.0/16 is variably subnetted, 5 subnets, 2 masks
          O       172.16.0.0/30 [110/65] via 172.16.0.9, 00:07:03, GigabitEthernet0/1      ( o = meme area )
          C       172.16.0.8/30 is directly connected, GigabitEthernet0/1
          L       172.16.0.10/32 is directly connected, GigabitEthernet0/1
          C       172.16.0.12/30 is directly connected, GigabitEthernet0/0
          L       172.16.0.14/32 is directly connected, GigabitEthernet0/0
              192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
          C       192.168.1.0/24 is directly connected, GigabitEthernet0/2
          L       192.168.1.1/32 is directly connected, GigabitEthernet0/2


----------------------------------------------------------------------------------------------------

Area 10 ( exercices packet tracer)



##### ***2 eme methode d'addressage d'area**** ( en remplacement de la commande network !!! pas sur tt les routers )


          Router#conf t
          Enter configuration commands, one per line.  End with CNTL/Z.
          Router(config)#int g0/0
          Router(config-if)#ip ospf 1 area 10


interface passive = ne recois pas et n'envoi pas de hello !

      R1(config)#router ospf 1
      R1(config-router)#passive-interface g0/0

sh ip protocol affiche la liste des interfaces passive



meme commande sur R4

      Router#conf t
      Enter configuration commands, one per line.  End with CNTL/Z.
      Router(config)#int g0/2
      Router(config-if)#ip ospf 1 area 20

##### ***interface passive par defaut***

      Router#conf t
      Enter configuration commands, one per line.  End with CNTL/Z.
      Router(config)#router ospf 1
      Router(config-router)#passive-interface default
      Router(config-router)#no passive-interface g0/0
      Router(config-router)#no passive-interface g0/1





verifier que les routes sont bonnes avec traceroute 

