# 20210414.3 CONFIG SUPPLEMENTAIRE HSRP [ LABO GNS3 ] 


ip address 224.0.0.2 ( normalement adresse ip des routeurs )

## TRACKING fonctionnalité ( retourné l'etat de quelque chose )


##### Creation sla

      MLS1(config)#ip sla 1
      MLS1(config-ip-sla)#?
      IP SLAs entry configuration commands:
        dhcp         DHCP Operation
        dns          DNS Query Operation
        exit         Exit Operation Configuration
        ftp          FTP Operation
        http         HTTP Operation
        icmp-echo    ICMP Echo Operation
        path-echo    Path Discovered ICMP Echo Operation
        path-jitter  Path Discovered ICMP Jitter Operation
        tcp-connect  TCP Connect Operation
        udp-echo     UDP Echo Operation
        udp-jitter   UDP Jitter Operation




        MLS1(config-ip-sla)#icmp-echo 90.24.2.5 source-interface g1/0
        MLS1(config-ip-sla-echo)#?
        IP SLAs Icmp Echo Configuration Commands:
          default            Set a command to its defaults
          exit               Exit operation configuration
          frequency          Frequency of an operation
          history            History and Distribution Data
          no                 Negate a command or set its defaults
          owner              Owner of Entry
          request-data-size  Request data size
          tag                User defined tag
          threshold          Operation threshold in milliseconds
          timeout            Timeout of an operation
          tos                Type Of Service
          verify-data        Verify data
          vrf                Configure IP SLAs for a VPN Routing/Forwarding instance


##### Verification SLA


        MLS1#sh ip sla statistics
        IPSLAs Latest Operation Statistics

        IPSLA operation id: 1
        Number of successes: Unknown
        Number of failures: Unknown
        Operation time to live: 0


##### Appliqué une requete au SLA ( sonde + attribution de la sonde )

        MLS1#conf t
        Enter configuration commands, one per line.  End with CNTL/Z.
        MLS1(config)#ip sla schedule 1 start-time now life forever



##### CREATION TRACKER


            MLS1#conf t
            MLS1(config)#ip sla schedule 1 start-time now life forever
            MLS1(config)#track 1 ip sla 1
            MLS1(config-track)#^Z
            MLS1#sh track
            *Apr 14 11:53:17.995: %SYS-5-CONFIG_I: Configured from console by console 1
            Track 1
              IP SLA 1 state
              State is Up
                1 change, last change 00:00:41
              Latest operation return code: OK
              Latest RTT (millisecs) 9




            MLS1#conf t
              Enter configuration commands, one per line.  End with CNTL/Z.
              MLS1(config)#int vlan 10
              MLS1(config-if)#standby 1 track 1 decrement 30


##### MLS2  - creation object de tracking depuis STATUS INTERFACE

      MLS2(config)#track 1 interface g1/0 line-protocol

      MLS2#sh track 1
      Track 1
        Interface GigabitEthernet1/0 line-protocol
        Line protocol is Up
          1 change, last change 00:00:29


    


