---
title: 20210503.2 IPV6 ROUTEUR
created: '2021-05-03T12:15:32.628Z'
modified: '2021-05-03T14:28:11.029Z'
---

# 20210503.2 IPV6 ROUTEUR

#### ***activer ipv6***

    P3R2(config)#int fa0/0
    P3R2(config-if)#ipv6 enable

    P3R2#sh ipv6 int brief
    
    FastEthernet0/0            [up/up]
        FE80::21E:7AFF:FE4C:A88E
    FastEthernet0/1            [administratively down/down]
        unassigned
    Serial0/1/0                [administratively down/down]
        unassigned
    Serial0/1/1                [administratively down/down]
        unassigned
    SSLVPN-VIF0                [up/up]
        unassigned

    P3R2#sh ipv6 int brief
    FastEthernet0/0            [up/up]
        FE80::21E:7AFF:FE4C:A88E
    FastEthernet0/1            [administratively down/down]
        unassigned
    Serial0/1/0                [administratively down/down]
        unassigned
    Serial0/1/1                [administratively down/down]
        unassigned
    SSLVPN-VIF0                [up/up]
        unassigned
        


    P3R2#sh ipv6 int fa0/0

    FastEthernet0/0 is up, line protocol is up
      IPv6 is enabled, link-local address is FE80::21E:7AFF:FE4C:A88E
      No Virtual link-local address(es):
      No global unicast address is configured
      Joined group address(es):
        FF02::1
        FF02::1:FF4C:A88E
      MTU is 1500 bytes
      ICMP error messages limited to one every 100 milliseconds
      ICMP redirects are enabled
      ICMP unreachables are sent
      ND DAD is enabled, number of DAD attempts: 1
      ND reachable time is 30000 milliseconds (using 23981)

#### ***adresse link local interface***

     P3R2(config)#int fa0/0
     P3R2(config-if)#ipv6 address FE80::20 link-local

     P3R2#sh ipv6 int brief
        FastEthernet0/0            [up/up]
              FE80::20

***P3R2#sh ipv6 neighbors***          ( EQUIVALENT TABLE ARP )

        IPv6 Address                              Age Link-layer Addr State Interface
        FE80::225:84FF:FE5D:BC20                   12 0025.845d.bc20  STALE Fa0/0
        FE80::21E:13FF:FE0C:1C52                   13 001e.130c.1c52  STALE Fa0/0
        FE80::21A:2FFF:FE55:8560                   13 001a.2f55.8560  STALE Fa0/0
        FE80::212:80FF:FEB6:650                    11 0012.80b6.0650  STALE Fa0/0
        FE80::21E:13FF:FE0B:FFE6                   13 001e.130b.ffe6  STALE Fa0/0
        FE80::21                                    2 001e.130b.ffe6  STALE Fa0/0
        FE80::21E:7AFF:FE4C:D484                   13 001e.7a4c.d484  STALE Fa0/0
        FE80::215:FAFF:FED7:F400                   13 0015.fad7.f400  STALE Fa0/0
        FE80::21E:7AFF:FE4C:9590                   11 001e.7a4c.9590  STALE Fa0/0
        FE80::21D:A1FF:FE04:ECA0                   12 001d.a104.eca0  STALE Fa0/0
        FE80::21E:13FF:FE0B:F8BA                   12 001e.130b.f8ba  STALE Fa0/0

        
#### ***Adress global***

        P3R2(config)#int fa0/0
        P3R2(config-if)#ipv6 address 2001:abcd:cafe:beef::20/64

        P3R2#sh ipv6 int brief
        
          FastEthernet0/0            [up/up]
              FE80::20
              2001:ABCD:CAFE:BEEF::20

#### ***activer le routage ipv6*** route statique


        P3R2(config)#int lo0
        P3R2(config-if)#
        P3R2(config-if)#ipv6 address 2001:AAAA:AAAA:20::/128    ( 20 = 32 = P3R2 )

        P3R2(config)#ipv6 route 2001:AAAA:AAAA:B::1/64 2001:ABCD:CAFE:BEEF::B  ( reseau + masque + nexthop)

        P3R2(config)#ipv6 unicast-routing

***verifier activation routing ipv6***

        #sh ipv6 int fa0/0
        FastEthernet0/0 is up, line protocol is up
          IPv6 is enabled, link-local address is FE80::20
          No Virtual link-local address(es):
          Global unicast address(es):
            2001:ABCD:CAFE:BEEF::20, subnet is 2001:ABCD:CAFE:BEEF::/64
          Joined group address(es):
            FF02::1
            FF02::2                                                   >>>>>>>>>>>>> IPV6 ROUTING ACTIVER
            FF02::1:FF00:20

        P3R2#sh run | inc unic
        ipv6 unicast-routing

***route avec link lokal***

      P3R2(config)#ipv6 route 2001:AAAA:AAAA:16::/64 fa0/0 fe80::16    (address link local pr le nexthop)



#### ***Desactiv√© routeur advertisement***   ( plus de config automatique possible ) ( a desactiver avec server dhcp)

      P3R2(config)#int fa0/0
      P3R2(config-if)#ipv6 nd ra suppress


#### ***Adresse avec EUI-64***

      P3R2(config)#int fa0/0
      P3R2(config-if)#ipv6 address FD00::/64 eui-64

      comme on a defini l'adresse link local , l'eui s'adapte a celle ci 




