# 20210406.2 VTP ( cisco )

##### Vlan trunking protocol

    Layer 2 > Centralisé la creation/suppression de vlan

    Domaine VTP 
        switch Serveur VTP
        switch Client VTP
        Transparent

    client ou server genere des messages vtp

    reinit le numero de revision
    
    changer le domaine , ou le passer dans le mode transparent


![](./assets/img/Clipboard_2021-04-06-14-29-43.png)


      MLS1#show vtp status                verifier information d etat de vtp


      VTP Version capable             : 1 to 3
      VTP version running             : 1
      VTP Domain Name                 :
      VTP Pruning Mode                : Disabled
      VTP Traps Generation            : Disabled
      Device ID                       : 0cfe.6618.8000
      Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00
      Local updater ID is 0.0.0.0 (no valid interface found)

      Feature VLAN:
      --------------
      VTP Operating Mode                : Server
      Maximum VLANs supported locally   : 1005
      Number of existing VLANs          : 5
      Configuration Revision            : 0
      MD5 digest                        : 0x57 0xCD 0x40 0x65 0x63 0x59 0x47 0xBD
                                          0x56 0x9D 0x4A 0x3E 0xA5 0x69 0x35 0xBC


##### ***Creation domain vtp***


      MLS1#conf t
      MLS1(config)#vtp domain cisco



      MLS1#sh vtp statu
      *Apr  6 12:33:12.223: %SYS-5-CONFIG_I: Configured from console by console
      MLS1#sh vtp status
      VTP Version capable             : 1 to 3
      VTP version running             : 1 
      VTP Domain Name                 : cisco
      VTP Pruning Mode                : Disabled
      VTP Traps Generation            : Disabled
      Device ID                       : 0cfe.6618.8000
      Configuration last modified by 0.0.0.0 at 4-6-21 12:33:11
      Local updater ID is 0.0.0.0 (no valid interface found)

      Feature VLAN:
      --------------
      VTP Operating Mode                : Server
      Maximum VLANs supported locally   : 1005
      Number of existing VLANs          : 6
      Configuration Revision            : 1                    >>>> increment a chaque changement
      MD5 digest                        : 0x39 0x6E 0x18 0x6D 0x1F 0x15 0xD2 0x32
                                          0xFA 0x7F 0x29 0x73 0x98 0x91 0xFC 0x52



##### ***changement mod vtp***

      MLS1(config)#vtp mode client
      Setting device to VTP Client mode for VLANS.

      pas de creation de vlan en client

      MLS1(config)#vtp mode server
      Setting device to VTP Server mode for VLANS.


##### ***reset n° révision***

      switch mode transparent puis mode client/server

      MLS3(config)#vtp domain truc.much
      Changing VTP domain name from cisco to truc.much

